helpdeskLPC11/app/Controllers/Ticket.php

SELECT *
FROM `company`
SELECT *
FROM `ticket`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `ticket`
---
    public function index($keyword = null)
    {
        //jika belum login, user tidak memiliki akses
        if (!$this->auth->check())
		{
			$redirectURL = session('redirect_url') ?? site_url('/login');
			unset($_SESSION['redirect_url']);

			return redirect()->to($redirectURL);
		}

        // $keyword = $this->request->getVar('keyword');
        // dd($keyword);
        if($keyword){
           $ticket = $this->model->search($keyword);
           //dd($ticket);
        }else{
            $ticket = $this->model;
        }

        $company = $this->companyModel->findAll();
        $pic = $this->picModel->findAll();
        $data = [
            'judul' => 'Data ticket',
            //'ticket' => $this->model->getAllData()
            //localhost:8080/ticket/page_?
            'pager' => $this->model->pager,
            'ticket' => $this->model->paginate('10', 'ticket'),