app/Controllers/Admin.php

SELECT *
FROM `auth_groups`
SELECT `users`.`id` as `userid`, `username`, `email`, `user_image`, `name`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
---
    public function index()
    {
        //jika belum login, user tidak memiliki akses hi
        if (!$this->auth->check())
		{
			$redirectURL = session('redirect_url') ?? site_url('/login');
			unset($_SESSION['redirect_url']);

			return redirect()->to($redirectURL);
		}

        $keyword = $this->request->getVar('keyword');
        if($keyword){
           $admin = $this->model->search($keyword);
        }else{
            $admin = $this->model;
        }

        $authgroup = $this->authgroupModel->findAll();
        $data = [
           'judul' => 'User List',
           'authgroup' => $authgroup

        ];

        $this->builder->select('users.id as userid, username, email, user_image, name');
        $this->builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');
        $this->builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id');
        //$this->builder->join('auth_permissions', 'auth_permissions.id = auth_groups_users.group_id');
        $query = $this->builder->get();

SELECT `users`.`id` as `userid`, `username`, `email`, `fullname`, `user_image`, `name`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
WHERE `users`.`id` = '15'
---
    public function detail($id = 0)
    {
        //jika belum login, user tidak memiliki akses
        if (!$this->auth->check())
		{
			$redirectURL = session('redirect_url') ?? site_url('/login');
			unset($_SESSION['redirect_url']);

			return redirect()->to($redirectURL);
		}

        $data = [
           'judul' => 'User Detail'
        ];
        $this->builder->select('users.id as userid, username, email, fullname, user_image, name');
        $this->builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');
        $this->builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id');
        $this->builder->where('users.id', $id);
        $query = $this->builder->get();