app/Controllers/Progress.php

SELECT *
FROM `progress`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `progress`
---
    public function index()
    {
        //jika belum login, user tidak memiliki akses
        if (!$this->auth->check())
		{
			$redirectURL = session('redirect_url') ?? site_url('/login');
			unset($_SESSION['redirect_url']);

			return redirect()->to($redirectURL);
		}

        $keyword = $this->request->getVar('keyword');
        if($keyword){
           $progress = $this->model->search($keyword);
        }else{
            $progress = $this->model;
        }

        $data = [
            'judul' => 'Data Progress',
            //'progress' => $this->model->getAllData()
            //localhost:8080/progress/page_?
            'progress' => $this->model->paginate('10', 'progress'),