app/Models/M_Company.php

INSERT INTO `company` (`name_company`) VALUES ('PT Kemas Indah Jaya')
---
    public function tambah($data)
    {
        return $this->db->table('company')->insert($data);

UPDATE `company` SET `name_company` = 'PT Adhi Karya (Persero)'
WHERE `id` = '3'
---
    public function ubah($data, $id)
    {
        return $this->db->table('company')->update($data, ['id' => $id]);