app/Models/M_Ticket.php

SELECT *
FROM `ticket`
---
    public function getAllData($id = false)
    {
        if ($id == false) {
            return $this->db->table('ticket')->get()->getResultArray();
        } else{
            $this->db->table('ticket')->where('id', $id);
            return $this->db->table('ticket')->get()->getRowArray();

UPDATE `ticket` SET `no_ticket` = '02', `user_id` = '1', `urgency` = 'High', `name_company` = 'Jasper Giles', `name_pic` = 'Muslih', `position_pic` = 'Support IT', `problem_company` = 'Error', `problem_details` = 'Detail Masalah', `status_ticket` = 'Pending', `image_ticket` = '1640763781230.jpg'
WHERE `id` = '2'
---
    public function ubah($data, $id)
    {
        return $this->db->table('ticket')->update($data, ['id' => $id]);